## WIP: Need to organize this file

tap "abdfnx/tap"
tap "abhimanyu003/sttr"
tap "aquasecurity/trivy"
tap "buo/cask-upgrade"
tap "datreeio/datree"
tap "derailed/k9s"
tap "derailed/popeye"
tap "fairwindsops/tap"
tap "go-task/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "mas"

# General Tools
brew "docker"
brew "gh"
brew "git"
brew "gnutls"
brew "gnupg"
brew "mkcert"
brew "neovim"
brew "vim"
brew "zsh"

# DevOps Tools
brew "hashicorp/tap/boundary"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "hashicorp/tap/waypoint"
brew "azure-cli"
cask "google-cloud-sdk"
brew "argocd"
brew "aquasecurity/trivy/trivy"
brew "datreeio/datree/datree"
brew "checkov", link: false
brew "derailed/k9s/k9s"
brew "derailed/popeye/popeye"
brew "kompose"
brew "kube-score"
brew "kubeaudit"
brew "kubeconform"
brew "kubectx"
brew "kustomize"
brew "helm"
brew "istioctl"
brew "jq"
brew "jsonnet-bundler"
brew "fairwindsops/tap/nova"
brew "fairwindsops/tap/pluto"
brew "fairwindsops/tap/polaris"

# Essential Tools
cask "brave-browser"
cask "font-hack-nerd-font"
cask "iterm2"
cask "gitkraken"
cask "lens"
cask "microsoft-teams"
cask "navicat-premium"
cask "slack"
cask "setapp"
cask "visual-studio-code"

# Language Tools
brew "go"
brew "nvm"

# Other Tools
cask "fig"
cask "loom"
cask "raycast"
cask "krisp"
cask "vlc"
brew "tailscale"
brew "tz"
brew "asciinema"
brew "bat"
brew "chezmoi"
brew "exa"
brew "fzf"
brew "golangci-lint"
brew "go-task/tap/go-task"
brew "k6"
brew "kind"
brew "minikube"
brew "sonar-scanner"
brew "teleport"
brew "telnet"
brew "terminal-notifier"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "tokei"
brew "tree"
brew "termius"
mas "tailscale"
mas "1355679052"