## Required Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

tap "aquasecurity/trivy"
tap "armosec/kubescape"
tap "buildpacks/tap"
tap "datreeio/datree"
tap "derailed/k9s"
tap "derailed/popeye"
tap "hashicorp/tap"
tap "jondot/tap"
tap "pulumi/tap"

## Cloud Providers CLI
brew "awscli" # Official Amazon AWS command-line interface
brew "azure-cli" # Microsoft Azure CLI 2.0

## Development Tools
brew "pyenv" # Python version management
brew "gh" # GitHub command-line tool
brew "git" # Distributed revision control system
brew "git-lfs" # Git extension for versioning large files
brew "go" # Open source programming language to build simple/reliable/efficient software
brew "k6" # Modern load testing tool, using Go and JavaScript
brew "nvm" # Manage multiple Node.js versions
brew "vim" # Vi 'workalike' with many additional features
brew "watchman" # Watch files and take action when they change
brew "phpbrew" # Brew & manage PHP versions in pure PHP at HOME

## DevOps Local Cluster
brew "kind" # Run local Kubernetes cluster in Docker
brew "minikube" # Run a Kubernetes cluster locally
brew "kubernetes-cli" # Kubernetes command-line interface

## DevOps Tools
brew "act" # Run your GitHub Actions locally 🚀
brew "argocd" # GitOps Continuous Delivery for Kubernetes
brew "argocd-autopilot" # Opinionated way of installing Argo CD and managing GitOps repositories
brew "helm" # Kubernetes package manager
brew "infracost" # Cost estimates for Terraform
brew "istioctl" # Istio configuration command-line utility
brew "kompose" # Tool to move from `docker-compose` to Kubernetes
brew "kubie" # Much more powerful alternative to kubectx and kubens
brew "kustomize" # Template-free customization of Kubernetes YAML manifests
brew "terraform-docs" # Tool to generate documentation from Terraform modules
brew "buildpacks/tap/pack"
brew "derailed/k9s/k9s"
brew "derailed/popeye/popeye"
brew "hashicorp/tap/boundary"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "hashicorp/tap/waypoint"
brew "pulumi/tap/pulumi"
brew "robscott/tap/kube-capacity"

## DevSecOps Tools
brew "checkov" # Prevent cloud misconfigurations during build-time for IaC tools
brew "datree" # CLI tool to run policies against Kubernetes manifests YAML files or Helm charts
brew "kube-score" # Kubernetes object analysis recommendations for improved reliability and security
brew "kubeaudit" # Helps audit your Kubernetes clusters against common security controls
brew "kubeconform" # FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubescape" # Kubernetes testing according to Hardening Guidance by NSA and CISA
brew "kubeval" # Validate Kubernetes configuration files, supports multiple Kubernetes versions
brew "pre-commit" # Framework for managing multi-language pre-commit hooks
brew "teleport" # Modern SSH server for teams managing distributed infrastructure
brew "tfsec" # Static analysis security scanner for your terraform code
brew "trivy" # Vulnerability scanner for container images, file systems, and Git repos

## Security
brew "dependency-check" # OWASP dependency-check
brew "gnutls" # GNU Transport Layer Security (TLS) Library
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "mkcert" # Simple tool to make locally trusted development certificates
brew "nss" # Libraries for security-enabled client and server applications

## Networking
brew "dog" # Command-line DNS client
brew "httpie" # User-friendly cURL replacement (command-line HTTP client)
brew "wget" # Internet file retriever

## Misc.
brew "asciinema" # Record and share terminal sessions
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "cask" # Emacs dependency management
brew "exa" # Modern replacement for 'ls'
brew "fd" # Simple, fast and user-friendly alternative to find
brew "fzf" # Command-line fuzzy finder written in Go
brew "htop" # Improved top (interactive process viewer)
brew "jd" # JSON diff and patch utility
brew "jq" # Lightweight and flexible command-line JSON processor
brew "mas" # Mac App Store command-line interface
brew "navi" # Interactive cheatsheet tool for the command-line
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "tldr" # Simplified and community-driven man pages
brew "terminal-notifier" # Send macOS User Notifications from the command-line
brew "tokei" # Program that allows you to count code, quickly
brew "tree"# Display directories as trees (with optional color/HTML output)
brew "tz" # CLI time zone visualizer
brew "yq" # Process YAML documents from the CLI

## Casks
cask "1password"
cask "docker"
cask "fantastical"
cask "fig"
cask "font-hack-nerd-font"
cask "gitkraken"
cask "google-chrome"
cask "iterm2"
cask "lens"
cask "microsoft-teams"
cask "rancher"
cask "raycast"
cask "setapp"
cask "signal"
cask "slack"
cask "spotify"
cask "visual-studio-code"
