# Brewfile for setting up a new macOS device with essential tools and applications

## Taps
tap "hashicorp/tap"

## Cloud Providers CLI
brew "aws-sso-cli" # Securely manage AWS API credentials using AWS SSO
brew "aws-vault" # Secure, cross-platform tool for managing AWS credentials
brew "awscli" # Official Amazon AWS command-line interface
brew "azure-cli" # Command-line tools for Azure
brew "gcloud-cli" # Google Cloud SDK command-line interface

## Container & Kubernetes
brew "helm" # The Kubernetes package manager
brew "istioctl" # Istio configuration command-line utility
# brew "k8sgpt" # Giving Kubernetes Superpowers to everyone
brew "k9s" # Kubernetes CLI To Manage Your Clusters In Style!
brew "kind" # Kubernetes in Docker - local clusters for testing Kubernetes
brew "kompose" # Tool to move from `docker-compose` to Kubernetes
# brew "kubie" # Much more powerful alternative to kubectx and kubens
brew "kubectx" # Tool that can switch between kubectl contexts easily and create aliases
brew "kubernetes-cli" # Kubernetes command-line interface
brew "kustomize" # Customization of Kubernetes YAML configurations

## Infrastructure as Code
brew "hashicorp/tap/terraform" # Terraform is a tool for managing Terraform modules and configurations
brew "infracost" # Cloud cost estimates for Terraform
brew "terraform-docs" # Tool to generate documentation from Terraform modules
brew "terragrunt" # Terragrunt is a tool for managing Terraform modules and configurations

## DevOps & CI/CD
brew "act" # Run your GitHub Actions locally
brew "argocd" # GitOps Continuous Delivery for Kubernetes
brew "buildkite/buildkite/bk@3" # Buildkite CLI
brew "helmfile" # Deploy Kubernetes Helm Charts

## Security & Secrets Management
brew "dependency-check" # OWASP dependency-check
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "hashicorp/tap/vault" # Tool for securely accessing secrets
brew "infisical/get-cli/infisical" # Backed by developers, open source, and secure
brew "mkcert" # Simple tool for making locally-trusted development certificates
brew "nss" # Libraries for security-enabled client and server applications
brew "pre-commit" # Framework for managing multi-language pre-commit hooks
brew "trivy" # Scanner for vulnerabilities in container images, file systems, and Git repositories

## Programming Languages & Runtimes
brew "cloudflare-wrangler" # Cloudflare Workers CLI
brew "go" # Open source programming language to build simple/reliable/efficient software
brew "oven-sh/bun/bun" # Fast, modern JavaScript runtime

## Version Managers
brew "mise" # Polyglot tool version manager
brew "pyenv" # Python version management
brew "nvm" # Manage multiple Node.js versions

## Package Managers
brew "pnpm" # Fast, disk space efficient package manager
brew "yarn" # Fast, reliable, and secure dependency management for JavaScript

## Git & Version Control
brew "gh" # GitHub command-line tool
brew "git" # Distributed revision control system
brew "git-lfs" # Git extension for versioning large files

## Development Tools & Editors
brew "vim" # Vi 'workalike' with many additional features
brew "neovim" # Ambitious Vim-fork focused on extensibility and usability
brew "watchman" # Watch files and take action when they change

## Testing & Performance
brew "k6" # Modern load testing tool, using Go and JavaScript

## Networking & HTTP
brew "dog" # Command-line DNS client
brew "httpie" # User-friendly cURL replacement
brew "wget" # Internet file retriever

## CLI Utilities
brew "asciinema" # Record and share terminal sessions
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "dockutil" # Tool for managing macOS Dock items
brew "exa" # Modern replacement for 'ls'
brew "fd" # Simple, fast and user-friendly alternative to 'find'
brew "fzf" # Command-line fuzzy finder
brew "htop" # Improved top (interactive process viewer)
brew "jd" # JSON diff and patch utility
brew "jq" # Lightweight and flexible command-line JSON processor
brew "mas" # Mac App Store command-line interface
brew "navi" # Interactive cheatsheet tool for the command-line
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "tldr" # Simplified and community-driven man pages
brew "tokei" # Program that allows you to count code, quickly
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "tz" # CLI time zone visualizer
brew "yq" # Process YAML documents from the CLI

## System Libraries
brew "gnutls" # GNU Transport Layer Security (TLS) Library
brew "libyaml" # YAML C library
brew "openssl@3" # Cryptography and SSL/TLS Toolkit

## GUI Applications - Browsers
cask "arc" # Web browser

## GUI Applications - Terminal
cask "warp" # Modern, Rust-based terminal with AI built in

## GUI Applications - Productivity
cask "1password" # Password manager that keeps all passwords secure behind one password
cask "1password-cli" # Command-line interface for 1Password
cask "adguard" # Ad blocker
cask "betterdisplay" # Display management tool
cask "logi-options+" # Software for Logitech devices
cask "microsoft-teams" # Meet, chat, call, and collaborate in just one place
cask "raycast" # Control your tools with a few keystrokes
cask "rectangle-pro" # Window snapping tool
cask "setapp" # Collection of apps for macOS and iOS
# cask "signal" # Private messaging app
cask "slack" # Team communication and collaboration software
cask "wins" # Bring your windows to your cursor

## GUI Applications - Development
cask "apidog-europe" # All-in-one API development and testing tool
cask "aptakube" # Modern Kubernetes GUI client
cask "docker-desktop" # App to build and share containerized applications and microservices
cask "gitkraken" # Git client for Windows, Mac & Linux
cask "gitkraken-cli" # GitKraken Command Line Interface
# cask "lens" # Kubernetes IDE
# cask "orbstack" # Replacement for Docker Desktop
# cask "postman" # Collaboration platform for API development
# cask "postman-cli" # Command-line companion for Postman
cask "visual-studio-code" # Open-source code editor

## GUI Applications - Fonts
cask "font-hack-nerd-font" # Developer targeted font with icons

## Mac App Store Apps
mas "Amphetamine", id: 937984704 # Keep-awake utility
